//Задание 1
//Преобразовать строку 'js' в верхний регистр.

let str = 'js';
str = str.toUpperCase();
console.log(js);

//Задание 2
//Создать функцию, которая принимает массив строк и строку. Функция должна вернуть новый массив, содержащий только те элементы первого массива, 
//которые начинаются со второй строки. Регистр символов не влияет на результат.


//Задание 3
//Округлить число 32.58884:
//1. До меньшего целого.
//2. До большего целого.
//3. До ближайшего целого.

//Задание 4
//Найти минимальное и максимальное значения из чисел 52, 53, 49, 77, 21, 32 и вывести их в консоль.

//Задание 5
//Создать функцию, которая выводит в консоль случайное число от 1 до 10.

//Задание 6
//Написать функцию, которая принимает целое число и возвращает массив случайных чисел от 0 до этого числа. 
//Длина массива должна быть в два раза меньше переданного числа.

//Задание 7
//Создать функцию, которая принимает два целых числа и возвращает случайное число в этом диапазоне.

//Задание 8
//Вывести в консоль текущую дату.

//Задание 9
//Создать переменную currentDate, хранящую текущую дату. Вывести дату, которая наступит через 73 дня после текущей.

//Задание 10
//Написать функцию, которая принимает дату и возвращает ее в формате:
//1. Дата: [число] [месяц на русском] [год] — это [день недели на русском].
//2. Время: [часы]:[минуты]:[секунды]